In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
dic={"murat":12,"burak":23,"samet":45}
age=[12,23,45]
name=["murat","burak","samet"]
npAge=np.array([12,23,45])

#### Pandas serileri numpy dizileri gibidir ancak numpydaki gibi çoğunlukla indexleme işlemlerinden hariç seriler üzerinde çok daha fazla hakimiyet imkanı ve veriyi kolay inceleme şansı sağlar. Pandas serileri datayı tek boyutlu olarak ister çok boyutlu girdi almaz

In [4]:
pd.Series(dic) #sözlükten pandas serisine çevirme

murat    12
burak    23
samet    45
dtype: int64

In [5]:
pd.Series(data=age,index=name) #listeden pandas serisine çevirme

murat    12
burak    23
samet    45
dtype: int64

In [6]:
pd.Series(npAge,name) #numpy dizisinden pandas serisine çevirme

murat    12
burak    23
samet    45
dtype: int32

In [7]:
x=pd.Series(np.arange(1,6),["a","b","c","d","e"])

In [8]:
y=pd.Series(np.arange(5,9),["a","b","c","d"])

In [9]:
x+y #aynı indexler için aritmetik işlemler yapılabilir ama aynı indexler bulunamazsa NaN değeri döner

a     6.0
b     8.0
c    10.0
d    12.0
e     NaN
dtype: float64

In [10]:
a=pd.Series(np.arange(1,6),["a","b","c","d","e"])

In [11]:
b=pd.Series(np.arange(5,10),["a","b","c","d","e"])

In [12]:
a!=b # "< > == !=" karşılaştırma operatörleri kullanılabilir. !!!Aynı indexler bulunamazsa hata verir

a    True
b    True
c    True
d    True
e    True
dtype: bool

## DataFrame

### Dataframe aslında birden fazla pandas serisinin yan yana gelmesi ile oluşur. Tıpkı excelde olduğu gibi açık ve kolay incelenebilir bir tablo sunar.

In [13]:
data=np.random.rand(4,3)

In [14]:
data

array([[0.99313589, 0.7168079 , 0.85980244],
       [0.90092777, 0.67391182, 0.67092658],
       [0.3052127 , 0.67828869, 0.03635714],
       [0.26043025, 0.47679351, 0.30640396]])

In [15]:
dataFrame=pd.DataFrame(data)

In [16]:
dataFrame

          0         1         2
0  0.993136  0.716808  0.859802
1  0.900928  0.673912  0.670927
2  0.305213  0.678289  0.036357
3  0.260430  0.476794  0.306404

In [17]:
newDataFrame=pd.DataFrame(data,index=["murat","zeynep","burak","banu"],columns=["puan1","puan2","puan3"])

In [18]:
newDataFrame

           puan1     puan2     puan3
murat   0.993136  0.716808  0.859802
zeynep  0.900928  0.673912  0.670927
burak   0.305213  0.678289  0.036357
banu    0.260430  0.476794  0.306404

In [19]:
newDataFrame["puan1"] #indexleme işlemi sütunları alır

murat     0.993136
zeynep    0.900928
burak     0.305213
banu      0.260430
Name: puan1, dtype: float64

In [20]:
newDataFrame[["puan1","puan3"]] #numpy da fancy indexing yapar gibi farklı konumlardaki sütunlara erişmek için

           puan1     puan3
murat   0.993136  0.859802
zeynep  0.900928  0.670927
burak   0.305213  0.036357
banu    0.260430  0.306404

In [21]:
newDataFrame.loc["murat"] # .loc fonksiyonu ile indexleme işlemi sütundan satırlara taşınır

puan1    0.993136
puan2    0.716808
puan3    0.859802
Name: murat, dtype: float64

In [22]:
newDataFrame.loc[["zeynep","banu"]]

           puan1     puan2     puan3
zeynep  0.900928  0.673912  0.670927
banu    0.260430  0.476794  0.306404

In [23]:
newDataFrame.iloc[0] # .iloc fonksiyonu indexleme işlemini "loc" ile satırlara taşırken "i" ilede index isimlerinden ziyade
#index numarası kullanmamıza izin verir

puan1    0.993136
puan2    0.716808
puan3    0.859802
Name: murat, dtype: float64

In [24]:
newDataFrame["puan4"]=newDataFrame["puan1"]+newDataFrame["puan1"] #dataFrame'e ekleme yapar

In [25]:
newDataFrame

           puan1     puan2     puan3     puan4
murat   0.993136  0.716808  0.859802  1.986272
zeynep  0.900928  0.673912  0.670927  1.801856
burak   0.305213  0.678289  0.036357  0.610425
banu    0.260430  0.476794  0.306404  0.520860

In [26]:
newDataFrame.drop("puan4",axis=1) #dataFrameden puan4 kolonunu siler ama newDataFrame bunun kaydını almaz

           puan1     puan2     puan3
murat   0.993136  0.716808  0.859802
zeynep  0.900928  0.673912  0.670927
burak   0.305213  0.678289  0.036357
banu    0.260430  0.476794  0.306404

In [27]:
newDataFrame

           puan1     puan2     puan3     puan4
murat   0.993136  0.716808  0.859802  1.986272
zeynep  0.900928  0.673912  0.670927  1.801856
burak   0.305213  0.678289  0.036357  0.610425
banu    0.260430  0.476794  0.306404  0.520860

In [28]:
newDataFrame.drop("puan4",axis=1,inplace=True) #dataFrameden puan4 kolonunu siler ve newDataFrame'e kayıt alır

In [29]:
newDataFrame

           puan1     puan2     puan3
murat   0.993136  0.716808  0.859802
zeynep  0.900928  0.673912  0.670927
burak   0.305213  0.678289  0.036357
banu    0.260430  0.476794  0.306404

In [30]:
newDataFrame[newDataFrame>0.5]

           puan1     puan2     puan3
murat   0.993136  0.716808  0.859802
zeynep  0.900928  0.673912  0.670927
burak        NaN  0.678289       NaN
banu         NaN       NaN       NaN

In [31]:
newDataFrame[newDataFrame["puan3"]>0.53] #tftf şeklinde gelen veri indexlerin yazdırılıp yazdırılmayacağını belirliyor

           puan1     puan2     puan3
murat   0.993136  0.716808  0.859802
zeynep  0.900928  0.673912  0.670927

In [32]:
print(newDataFrame["puan3"]>0.53)
newDataFrame[[True,False,True,False]]#yukardaki kodun çalışma şekli

murat      True
zeynep     True
burak     False
banu      False
Name: puan3, dtype: bool

          puan1     puan2     puan3
murat  0.993136  0.716808  0.859802
burak  0.305213  0.678289  0.036357

In [33]:
newDataFrame.reset_index(inplace=True) # !!!reset_index yapıldığında var olan indexler yeni bir kolon olarak dataFrame'e eklenir

In [34]:
newDataFrame

    index     puan1     puan2     puan3
0   murat  0.993136  0.716808  0.859802
1  zeynep  0.900928  0.673912  0.670927
2   burak  0.305213  0.678289  0.036357
3    banu  0.260430  0.476794  0.306404

In [35]:
newDataFrame["yeni index"]=["mur","zey","bur","ban"]

In [36]:
newDataFrame

    index     puan1     puan2     puan3 yeni index
0   murat  0.993136  0.716808  0.859802        mur
1  zeynep  0.900928  0.673912  0.670927        zey
2   burak  0.305213  0.678289  0.036357        bur
3    banu  0.260430  0.476794  0.306404        ban

In [37]:
newDataFrame.set_index("yeni index",inplace=True)

In [38]:
newDataFrame

             index     puan1     puan2     puan3
yeni index
mur          murat  0.993136  0.716808  0.859802
zey         zeynep  0.900928  0.673912  0.670927
bur          burak  0.305213  0.678289  0.036357
ban           banu  0.260430  0.476794  0.306404

### DataFrame Multi Indexing

In [39]:
ilkIndex=["metal","metal","metal","plastik","plastik","plastik"]

In [40]:
icIndex=["tornavida","araba","bilye","şişe","kalem","fırça"]

In [41]:
top=list(zip(ilkIndex,icIndex))

In [42]:
top=pd.MultiIndex.from_tuples(top)

In [43]:
print(top)
type(top)

MultiIndex([(  'metal', 'tornavida'),
            (  'metal',     'araba'),
            (  'metal',     'bilye'),
            ('plastik',      'şişe'),
            ('plastik',     'kalem'),
            ('plastik',     'fırça')],
           )

pandas.core.indexes.multi.MultiIndex

In [44]:
data=[[2,"A"],[4,"B"],[5,"C"],[3,"D"],[8,"E"],[1,"F"]]

In [45]:
dF=pd.DataFrame(data,index=top,columns=["kalite","sınıf"]) #multi index dataframe oluşturma şekli

In [46]:
dF

                   kalite sınıf
metal   tornavida       2     A
        araba           4     B
        bilye           5     C
plastik şişe            3     D
        kalem           8     E
        fırça           1     F

In [47]:
dF["kalite"]

metal    tornavida    2
         araba        4
         bilye        5
plastik  şişe         3
         kalem        8
         fırça        1
Name: kalite, dtype: int64

In [48]:
dF.loc["metal"]

           kalite sınıf
tornavida       2     A
araba           4     B
bilye           5     C

In [49]:
print(dF.loc["plastik"].loc["şişe"])
#aynı çıktıyı verirler
print(dF.loc["plastik","şişe"])

kalite    3
sınıf     D
Name: şişe, dtype: object
kalite    3
sınıf     D
Name: (plastik, şişe), dtype: object

In [50]:
dF.index.names=["tür","çeşit"] #indexlere isim tanımlama

In [51]:
dF

                   kalite sınıf
tür     çeşit
metal   tornavida       2     A
        araba           4     B
        bilye           5     C
plastik şişe            3     D
        kalem           8     E
        fırça           1     F

## Dataframe eksik veriler

In [52]:
dic={"hatay":[10,np.nan,30],"afyon":[22,43,np.nan],"maraş":[12,np.nan,np.nan],"bursa":[12,34,23]}

In [53]:
havaDF=pd.DataFrame(dic)

In [54]:
havaDF

   hatay  afyon  maraş  bursa
0   10.0   22.0   12.0     12
1    NaN   43.0    NaN     34
2   30.0    NaN    NaN     23

In [55]:
havaDF.dropna() #indexler arasında gezer ve NaN veri bulunan indexleri siler

   hatay  afyon  maraş  bursa
0   10.0   22.0   12.0     12

In [56]:
havaDF.dropna(axis=1) #kolonlar için araştırır

   bursa
0     12
1     34
2     23

In [57]:
havaDF #kayıt alınması yine inplace=True yazılmalıdır

   hatay  afyon  maraş  bursa
0   10.0   22.0   12.0     12
1    NaN   43.0    NaN     34
2   30.0    NaN    NaN     23

In [58]:
havaDF.dropna(thresh=2) # NaN olmayan en az 2 değeri varsa karışmaz yoksa siler (kolonlarda araştırma yapmak için axis=1 ekle.)

   hatay  afyon  maraş  bursa
0   10.0   22.0   12.0     12
1    NaN   43.0    NaN     34
2   30.0    NaN    NaN     23

In [59]:
havaDF["yoklar"]=[np.nan,np.nan,np.nan]
havaDF

   hatay  afyon  maraş  bursa  yoklar
0   10.0   22.0   12.0     12     NaN
1    NaN   43.0    NaN     34     NaN
2   30.0    NaN    NaN     23     NaN

In [60]:
havaDF.dropna(how='all',axis=1) #eğer kolondaki bütün değerler NaN ise siler.(how=[all,any] default=any)

   hatay  afyon  maraş  bursa
0   10.0   22.0   12.0     12
1    NaN   43.0    NaN     34
2   30.0    NaN    NaN     23

In [61]:
havaDF.dropna(subset=["bursa","hatay"]) #NaN değerlerin aranacağı kolonları elle verebiliriz.

   hatay  afyon  maraş  bursa  yoklar
0   10.0   22.0   12.0     12     NaN
2   30.0    NaN    NaN     23     NaN

In [62]:
havaDF.fillna("xx") #NaN değerler "xx" ile doldurulur.

  hatay afyon maraş  bursa yoklar
0    10    22    12     12     xx
1    xx    43    xx     34     xx
2    30    xx    xx     23     xx

## Groupby

In [63]:
maasDict={"Departman":["yazılım","yazılım","pazarlama","pazarlama","hukuk","hukuk"],
          "Calisan":["ahmet","mehmet","zeynep","banu","ilay","murat"],
          "maas":[100,200,300,400,500,600]}

In [64]:
maasDF=pd.DataFrame(maasDict)

In [65]:
maasDF

   Departman Calisan  maas
0    yazılım   ahmet   100
1    yazılım  mehmet   200
2  pazarlama  zeynep   300
3  pazarlama    banu   400
4      hukuk    ilay   500
5      hukuk   murat   600

In [66]:
grupObjesi=maasDF.groupby("Departman") #Departman altındaki başlıkları aynı olmalarına göre gruplandırır
#ve sonrasında gruplar üzerinden  dataframe işlemleri yapılabilir

In [67]:
print(grupObjesi.count())
print(grupObjesi.mean())
print(grupObjesi.min())
#...vs

           Calisan  maas
Departman
hukuk            2     2
pazarlama        2     2
yazılım          2     2
           maas
Departman
hukuk       550
pazarlama   350
yazılım     150
          Calisan  maas
Departman
hukuk        ilay   500
pazarlama    banu   300
yazılım     ahmet   100

In [68]:
grupObjesi.describe() #istatiksel verileri toplu halde verir

           maas
          count   mean        std    min    25%    50%    75%    max
Departman
hukuk       2.0  550.0  70.710678  500.0  525.0  550.0  575.0  600.0
pazarlama   2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
yazılım     2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0